posts/2009-10-13-schusterman-lecture.org
#+date: <2009-10-13>
#+filetags: religion
#+title: Schusterman Lecture

Monday, October 19, is the Ninth Annual Schusterman Lecture in Jewish History and Traditions at Oklahoma Baptist University. Dr. Jacob Neusner will present two different, but related, lectures on comparing Gospels and Rabbinic writings, one at 10 a.m. and another at 7 p.m. Both lectures are in room 220 of the Geiger Center.

Dr. Neusner is the Distinguished Service Professor of the History and Theology of Judaism and Senior Fellow at the Institute of Advanced Theology at Bard College. He is also a member of the Institute for Advanced Study at Princeton and a life member of Clare Hall at Cambridge University. The lectures are free and open to the public.

He is the most published humanities scholar in the world, having published well over a thousand books and articles, including a twenty-two volume translation and commentary of the Babylonian Talmud.


#+begin_tagline
Tagged: religion
#+end_tagline
