docs/posts/2009-10-13-schusterman-lecture.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 27, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Schusterman Lecture</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Schusterman Lecture</h1>
<p class="subtitle" role="doc-subtitle">Oct 13, 2009</p>
</header><p>
Monday, October 19, is the Ninth Annual Schusterman Lecture in Jewish History and Traditions at Oklahoma Baptist University. Dr. Jacob Neusner will present two different, but related, lectures on comparing Gospels and Rabbinic writings, one at 10 a.m. and another at 7 p.m. Both lectures are in room 220 of the Geiger Center.
</p>

<p>
Dr. Neusner is the Distinguished Service Professor of the History and Theology of Judaism and Senior Fellow at the Institute of Advanced Theology at Bard College. He is also a member of the Institute for Advanced Study at Princeton and a life member of Clare Hall at Cambridge University. The lectures are free and open to the public.
</p>

<p>
He is the most published humanities scholar in the world, having published well over a thousand books and articles, including a twenty-two volume translation and commentary of the Babylonian Talmud.
</p>


<div class="tagline" id="orgf6f0f07">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 27, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
